# SERVICES = '''
#             \n*Услуги и стоимость*\
#             \n\
#             \n*1. Расклад 3к.*\
#             \nРасклад на 3 карты. Получение информации о перспективах и возможностях ситуации, ее исходе. По итогу расклад может состоять от 4 до 10 карт. Это очень много и очень точной информации. Ответ будет описывать все самые глубокие аспекты и стороны ситуации, а также все скрытые мотивы. Расклад подходит для выбора вариантов решения задачи, анализ бизнес-решений.\
#             \nКаждый вариант - один расклад.\
#             \nСтоимость - 3 000 руб.\
#             \n\
#             \n*2. Родовой расклад.*\
#             \nРасклад на 6 карт. Анализ родовых программ человека по мужской и женской линии и их влияние на жизнь человека.\
#             \nСтоимость - 4 000 руб.\
#             \n\
#             \n*3. Кельтский крест.*\
#             \nРасклад на 10 карт. Можно смотреть:\
#             \n- Энергетику человека на наличие негатива и бессознательных программ.\
#             \n- Отношения с партнерами\
#             \n- Общий прогноз на полгода/год - короткий анализ прошлой и настоящей ситуации, создающих ближайшее будущее и рекомендации по возможным вариантам улучшения ситуации.\
#             \nСтоимость - 7 000 руб.\
#             \n\
#             \n*4. Астрологический расклад.*\
#             \nРасклад на 27 карт.\
#             \n- Энергетика человека по 12 сферам жизни.\
#             \n- Прогноз на полгода/год/месяц.\
#             \nСтоимость - 15 000 руб.\
#             \n\
#             \n*5. Личная консультация*\
#             \nЧасовая диагностическая консультация это онлайн видео-встреча в Zoom, Skype, Telegram (по выбору), где мы проанализируем ваш запрос различными раскладами. Мы также можем посмотреть ваше энергетическое состояние раскладом Кельтский Крест на 10 карт.\
#             \nЗа час делается 5-10 раскладов в зависимости от вопроса.\
#             \nСтоимость - 10 000 руб.\
#             \n\
#             \n*6. Консультация ПРЕДНАЗНАЧЕНИЕ Онлайн встреча 1.5 часа.*\
#             \nНазначается за 2-3 недели до встречи. За это время я делаю:\
#             \n- Натальную астрологическую карту по дате, времени и месту рождения.\
#             \n- Расклад на Предназначение.\
#             \n- Родовой расклад.\
#             \n- Кармические задачи.\
#             \n- Астрологический на энергетику.\
#             \n- Анализ личности\
#             \n- Анализ публичностей\
#             \n- И по необходимости несколько простых раскладов. 
#             \nСтоимость - 30 000 руб.\
#             \n\
#             \nТак же делаю и другие расклады по запросу и только после диагностики:\
#             \nЧакральный - 4 000 руб.\
#             \nМагические способности - 25 000 руб.\
#             \nОтношения - 20 00 руб.\
#             \nПирамида Исиды - анализ связи кармических и родовых программ и их влияние на вашу энергетику в текущем моменте. 10 000 руб.\
#             '''

SERVICES = 'Выберите услугу 👇'

FREE = '''
        \n*Бесплатно*\
        \n\
        \n1. [Медитация очищения блоков и страхов](https://youtu.be/HoNhGeZ9CGQ)\
        \n2. [Гайд "ГДЕ ТВОИ ДЕНЬГИ"](https://disk.yandex.ru/i/BVosNX1fKu6pVQ)\
        '''

STARS = '''
        \n*Запись на астрорасклад.*\
        \n\
        \nПривет!\
        \n\
        \nБлагодарю за регистрацию на астрорасклад Таро.\
        \n\
        \nПрошу Вас внимательно ознакомиться с информацией.\
        \n\
        \n📜 Правила проведения консультации:\
        \n1. Необходимо заранее сформулировать запрос и вопросы к нему.\
        \n2. Для экономии времени консультации (а это ваши деньги) необходимо прислать голосовыми сообщениями общую информацию о Вашем запросе/ситуации.\
        \n\
        \nОплатить можно переводом на карту: (*стоимость 15 000 руб.*)\
        \n*Для граждан России:*\
        \nСбербанка: 5336690318052273\
        \nМКБ: 5327430010013567\
        \nТинькофф: 5536913890520204\
        \nАнна Владимировна Я.\
        \n\
        \n*Для граждан других государств:*\
        \n5269880013129754\
        \nIBAN $:\
        \nKZ30551B229777462USD\
        \n\
        \nIBAN€\
        \nKZ77551B229750110EUR\
        \n\
        \nОстались вопросы, свяжитесь с поддержкой infoyakovleva@yandex.ru\
        \n\
        \nС уважением,\
        \nАнна Яковлева.\
        \n\
        \nПосле совершения оплаты по представленным реквизитам - сохраните чек об оплате (скриншот или документ) - это понадобится для верификации платежа, для подтверждения платежа жмите на кнопку "Оплачено" 👇\
        '''


HOURLY = '''
        \n*Запись на консультацию.*\
        \n\
        \nПривет!\
        \n\
        \nБлагодарю за запись на часовую консультацию диагностик Таро.\
        \n\
        \nПрошу Вас внимательно прочесть информацию.\
        \n\
        \nЧасовая диагностическая консультация это онлайн видео-встреча в Zoom, Skype, Telegram (по выбору), где мы проанализируем ваш запрос различными раскладами. Мы также можем посмотреть ваше энергетическое состояние раскладом Кельтский Крест на 10 карт.\
        \nЗа час делается 5-10 раскладов в зависимости от вопроса.\
        \n\
        \n*Стоимость консультации*\
        \n60 минут - 10 000 руб. (Дополнительные 30 минут - 5 000 руб)\
        \n\
        \n🔴 Важно❗️\
        \nВ данную консультацию НЕ ВХОДИТ астрологический расклад. Для записи на астрорасклад вернитесь в главное меню.\
        \n\
        \n📜 Правила проведения консультации:\
        \n1. Необходимо заранее сформулировать запрос и вопросы к нему.\
        \n2. Для экономии времени консультации (а это ваши деньги) необходимо прислать голосовыми сообщениями общую информацию о Вашем запросе/ситуации.\
        \n\
        \nОплатить можно переводом на карту:\
        \n*Для граждан России:*\
        \nСбербанка: 5336690318052273\
        \nМКБ: 5327430010013567\
        \nТинькофф: 5536913890520204\
        \nАнна Владимировна Я.\
        \n\
        \n*Для граждан других государств*:\
        \n5269880013129754\
        \nIBAN $:\
        \nKZ30551B229777462USD\
        \n\
        \nIBAN€\
        \nKZ77551B229750110EUR KZ77551B229750110EUR\
        \n\
        \nОстались вопросы, свяжитесь с поддержкой infoyakovleva@yandex.ru\
        \n\
        \nС уважением,\
        \nАнна Яковлева.\
        \n\
        \nПосле совершения оплаты по представленным реквизитам - сохраните чек об оплате (скриншот или документ) - это понадобится для верификации платежа, для подтверждения платежа жмите на кнопку "Оплачено" 👇\
        '''

DESTINY = '''
        \n*Запись на консультацию Предназначение.*\
        \n\
        \nПривет!\
        \n\
        \nБлагодарю за регистрацию на часовую консультацию диагностик Таро.\
        \n\
        \nПрошу Вас внимательно прочесть информацию.\
        \n\
        \nОнлайн видео-встреча в Zoom, Skype, Telegram (по выбору) 1.5 часа.\
        \nНазначается за 2-3 недели до встречи.\
        \nЗа это время я делаю:\
        \n- Натальную астрологическую карту по дате, времени и месту рождения.\
        \n- Расклад на Предназначение.\
        \n- Родовой расклад.\
        \n- Кармические задачи.\
        \n- Астрологический на энергетику.\
        \n- Анализ личности\
        \n- Анализ публичностей\
        \n- И по необходимости несколько простых или тематических раскладов.\
        \n\
        \nСтоимость консультации\
        \n90 минут - 30 000 руб. (Дополнительные 30 минут - 5 000 руб)\
        \n\
        \n📜 Правила проведения консультации.\
        \n1. Необходимо заранее сформулировать запрос и вопросы к нему.\
        \n2. Для экономии времени консультации (а это ваши деньги) необходимо прислать голосовыми сообщениями общую информацию о Вашем запросе/ситуации.\
        \n\
        \nОплатить можно переводом на карту:\
        \nДля граждан России\
        \nСбербанка: 5336690318052273\
        \nМКБ: 5327430010013567\
        \nТинькофф: 5536913890520204\
        \nАнна Владимировна Я.\
        \n\
        \nДля граждан других государств:\
        \n5269880013129754\
        \nIBAN $:\
        \nKZ30551B229777462USD\
        \n\
        \nIBAN€\
        \nKZ77551B229750110EUR\
        \n\
        \nОстались вопросы, свяжитесь с поддержкой infoyakovleva@yandex.ru\
        \n\
        \nС уважением,\
        \nАнна Яковлева.\
        \n\
        \nПосле совершения оплаты по представленным реквизитам - сохраните чек об оплате (скриншот или документ) - это понадобится для верификации платежа, для подтверждения платежа жмите на кнопку "Оплачено" 👇\
        '''


K3 = '''
    \n*Расклад 3к.*\
    \nРасклад на 3 карты. Получение информации о перспективах и возможностях ситуации, ее исходе. По итогу расклад может состоять от 4 до 10 карт. Это очень много и очень точной информации. Ответ будет описывать все самые глубокие аспекты и стороны ситуации, а также все скрытые мотивы. Расклад подходит для выбора вариантов решения задачи, анализ бизнес-решений.\
    \nКаждый вариант - один расклад.\
    \nСтоимость - 3 000 руб.\
    \n\
    \nПосле совершения оплаты по представленным реквизитам - сохраните чек об оплате (скриншот или документ) - это понадобится для верификации платежа, для подтверждения платежа жмите на кнопку "Оплачено" 👇\
    '''

FAMILY = '''
        \n*Родовой расклад.*\
        \nРасклад на 6 карт. Анализ родовых программ человека по мужской и женской линии и их влияние на жизнь человека.\
        \nСтоимость - 4 000 руб.\
        \n\
        \nПосле совершения оплаты по представленным реквизитам - сохраните чек об оплате (скриншот или документ) - это понадобится для верификации платежа, для подтверждения платежа жмите на кнопку "Оплачено" 👇\
        '''

CROSS = '''
        \n*Кельтский крест.*\
        \nРасклад на 10 карт. Можно смотреть:\
        \n- Энергетику человека на наличие негатива и бессознательных программ.\
        \n- Отношения с партнерами\
        \n- Общий прогноз на полгода/год - короткий анализ прошлой и настоящей ситуации, создающих ближайшее будущее и рекомендации по возможным вариантам улучшения ситуации.\
        \nСтоимость - 7 000 руб.\
        \n\
        \nПосле совершения оплаты по представленным реквизитам - сохраните чек об оплате (скриншот или документ) - это понадобится для верификации платежа, для подтверждения платежа жмите на кнопку "Оплачено" 👇\
        '''

CHAKRAS = '''
        \nЧакральный - 4 000 руб.\
        \n\
        \nПосле совершения оплаты по представленным реквизитам - сохраните чек об оплате (скриншот или документ) - это понадобится для верификации платежа, для подтверждения платежа жмите на кнопку "Оплачено" 👇\
        '''

MAGIC = '''
        \nМагические способности - 25 000 руб.\
        \n\
        \nПосле совершения оплаты по представленным реквизитам - сохраните чек об оплате (скриншот или документ) - это понадобится для верификации платежа, для подтверждения платежа жмите на кнопку "Оплачено" 👇\
        '''

RELATIONS = '''
        \nОтношения - 20 00 руб.\
        \n\
        \nПосле совершения оплаты по представленным реквизитам - сохраните чек об оплате (скриншот или документ) - это понадобится для верификации платежа, для подтверждения платежа жмите на кнопку "Оплачено" 👇\
        '''

PYRAMID = '''
        \nПирамида Исиды - анализ связи кармических и родовых программ и их влияние на вашу энергетику в текущем моменте. 10 000 руб.\
        \n\
        \nПосле совершения оплаты по представленным реквизитам - сохраните чек об оплате (скриншот или документ) - это понадобится для верификации платежа, для подтверждения платежа жмите на кнопку "Оплачено" 👇\
        '''

NO_USERNAME = 'Для заполнения контактной формы, укажите, пожалуйста, имя пользователя в настройках telegram.\nПосле чего воспользуйтесь кнопкой "Оплачено" 👇 для подтверждения платежа.'

HELP = 'Если у Вас возникли вопросы, свяжитесь с поддержкой *infoyakovleva@yandex.ru*'

PAID = 'Ваши данные переданы на разбор, пожалуйста, в настройках Telegram разрешите отправку сообщений всем пользователям, чтобы я могла с Вами связаться.\n\nЕсли возникли вопросы, можете воспользоваться кнопкой 👇'